nums = [
    [1, 2, 3],
    [4, 5, 6, 7],
    [8, 9]
]

for x in nums:
    for y in x:
        print(y)
    print("--------")

print("****************************")
"""
2.给定一个含有n个元素的整型列表，如果元素出现的次数为奇数次，就输出
"""
nums1 = [1, 2, 4, 1, 4, 2, 1, 3, 1, 4, 5, 3]
set1 = set(nums1)  # {1, 2, 3, 4, 5}

# for x in nums1:
#     if nums1.count(x) % 2 != 0:  # 不去重的情况下,每个满足条件的元素都会进行输出,例如4出现三次,则输出三次
#         print(x)

# step1: 求每个元素出现的次数 list.count(100) -->0
# step2: 判断是否是奇数次

for x in set1:
    if nums1.count(x) % 2 != 0:
        print(x)

"""
3.有两个有序列表，[1，3，5，7，9]和[2，4，6，7，8]，设计使两个列表合并，
并且剔除掉两个列表里重复的元素。{1,2,3,4,5,6,7,8,9}。
"""
list1 = [1, 3, 5, 7, 9]
list2 = [2, 4, 6, 7, 8]

# step1: 合并列表
list3 = list1 + list2  # 产生一个新列表
#  list1.extend(list2)  # 给list1扩充数据

# step2: 去除重复
set1 = set(list3)
list4 = list(set1)
print(list4)
 # [1, 2, 3, 4, 5, 6, 7, 8, 9]

"""
4.给定两个含有n个元素的有序（非降序）整型列表a和b，求出其共同元素(求交集)
"""
a = [0, 1, 2, 3, 4]
b = [1, 3, 5, 7, 9]
print(set(a) & set(b))  # {1, 3}




