"""
    1. 列表的切片
        列表名[start : stop : step]
        * 切片之后的结果 生成一个新的列表 原列表不发生改变

    2. 列表的拼接
        + 将两个列表拼接 生成一个新的列表
        * 将一个列表自拼 生成一个新的列表
"""
list1 = ["李小花", "王二狗", "刘三胖", "赵铁柱", "史狗剩"]
# 1. 切片获取 ["王二狗", "刘三胖", "赵铁柱"]
print(list1[1:4:])
# 2. 切片获取 ["李小花", "刘三胖", "史狗剩"]
print(list1[::2])
# 3. 切片获取 ["史狗剩", "刘三胖", "李小花"]
print(list1[::-2])
# 4. 通过切片反转列表
print(list1[::-1])
# 5. 切片获取整个列表
print(list1[::])
# 6. 切片获取 ["李小花", "王二狗"]
print(list1[:2:])
# 7. 切片获取 ["刘三胖","王二狗","李小花"]
print(list1[2::-1])

# 列表的拼接
# +

list3 = [100, 200]
list2 = [2, 3, 4]

res_list1 = list2 + list3
res_list2 = list3 * 2

print(res_list1)  # [2, 3, 4, 100, 200]
print(res_list2)  # [100, 200, 100, 200]

print(list3)  # [100, 200]
print(list2)  # [2, 3, 4]

