"""
    字典: dict
        python内6置的基础数据结构之一;
        一组无序的键值对的组合;
            理解为: 容器中存储的是成对的数据;

            李小花: 13366667777
            王二狗: 13838381438
            key(键) : value(值)

        1. 语法声明
            1 . d1 = {}  # <class 'dict'>
                d2 = {
                    key1 : value1,
                    key2 : value2,
                    key3 : value3,
                    }
            2. 通过dict()声明一个字典:
                (1). dict() 创建一个空字典
                (2). dict() 接收一个字典作为参数 ---> 创建一个字典
                (3). dict() 接收列表套元组的数据结构 ---> 创建一个字典
                (4). dict() 接收关键字参数 --> 创建一个字典

        2. 特点
            1. 字典是无序的
            2. 字典的key(键)必须是不可变的数据类型
            3. 字典的value(值)可以是任意的数据类型.
            4. 字典是可变的数据类型.

"""
d1 = {}
print(type(d1))  # <class 'dict'>

d2 = {"李小花": "13366667777", "王二狗": "13838381438"}
print(d2)  # {'李小花': '13366667777', '王二狗': '13838381438'}
print(type(d2))  # <class 'dict'>

# (1). dict() 创建一个空字典
d3 = dict()
print(d3)  # {}

# (2). dict() 接收一个字典作为参数 ---> 创建一个字典
d4 = dict({"姓名": "李小花", "年龄": 18})
print(d4)  # {'姓名': '李小花', '年龄': 18}

# (3). dict() 接收列表套元组的数据结构 ---> 创建一个字典
d5 = dict(
    [
        ("姓名", "李小花"),  # 一个元组就是一个键值对
        ("年龄", 18)
    ]
)
print(d5)  # {'姓名': '李小花', '年龄': 18}

# dict() 接收关键字参数 --> 创建一个字典
d6 = dict(name="李小花", age=18)
print(d6)  # {"name": "李小花", "age": 18}

d7 = dict(姓名="李小花", 年龄=18)
print(d7)  # {'姓名': '李小花', '年龄': 18}

print("============================")
d8 = {100: "123", 0.9: "444"}
print(d8)  # {100: '123', 0.9: '444'}

# d9 = {[1, 2]: ("a", "b")}
# print(d9)  # TypeError: unhashable type: 'list'

d10 = {("a", "b"): [1, 2]}
print(d10)  # {('a', 'b'): [1, 2]}




